In [6]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

df = pd.read_csv("../../data/National_education_cost/CP3-pub-4y-current-dollars.csv")
import warnings
warnings.filterwarnings("ignore")

# df.drop(["Unnamed: 23", ], axis=1, inplace=True)
df.head()

,State,2004-05,2005-06,2006-07,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,...,2016-17,2017-18,2018-19,2019-20,2020-21,2021-22,2022-23,2023-24,1-Year % Change,5-Year % Change
0,Alabama,4510,4782,4906,5244,5968,6487,7373,8001,8734,...,10083,10650,10777,10922,10996,11338,11683,11890,0.02,0.10
1,Alaska,3435,3793,4194,4425,4678,4922,5261,5455,5785,...,7128,7440,7821,8233,8610,8815,9024,9163,0.02,0.17
2,Arizona,4078,4434,4674,4959,5584,6554,8075,9435,9728,...,10931,11210,11545,11879,11811,11820,12184,12583,0.03,0.09
3,Arkansas,4581,4980,5314,5599,5914,5980,6304,6654,6995,...,8254,8550,8701,9036,9078,9250,9478,9734,0.03,0.12
4,California,4195,4526,4549,4951,5436,6550,7485,8933,8986,...,9302,9800,9875,9854,9924,9943,10353,10641,0.03,0.08

In [7]:
to_drop = ["1-Year % Change", "5-Year % Change"]
df.drop(to_drop, axis=1,inplace=True)

In [8]:
melted_df = pd.melt(df, id_vars=["State"], var_name="Year", value_name="Value")
melted_df.sort_values(by=["State", "Year"]).reset_index(drop=True)

        State        Year  Value
0     Alabama    2007-08    5244
1     Alabama     2004-05   4510
2     Alabama     2005-06   4782
3     Alabama     2006-07   4906
4     Alabama     2008-09   5968
...       ...         ...    ...
1015  Wyoming     2019-20   5581
1016  Wyoming     2020-21   5792
1017  Wyoming     2021-22   6097
1018  Wyoming     2022-23   6441
1019  Wyoming     2023-24   6698

[1020 rows x 3 columns]